/*
 * 		자바 => 형식
 * 		1) 변수 : 한개의 데이터를 저장할 메모리 공간의 이름
 * 				------------
 * 			변수 선언
 * 			 데이터형 변수명; (자바) => 변수 데이터형 (오라클)
 * 			-------   ㅣ	
 * 			   ㅣ	  ㅣ
 * 			   1) 	  2) 
 * 			변수 초기값
 * 			1. 자바에서 제공하는 데이터형 (기본형)
 * 			   정수형
 * 				byte (1byte) => -128~127 => 8bit (bit:0,1)=>숫자표현
 * 											2진법
 * 					=> 파일 읽기 / 파일 쓰기 / 업로드 / 다운로드 / 네트워크 통신
 * 				int (4byte) => 32bit => 정수의 default (가장 많이 사용)
 * 				long(8byte) => 64bit => 빅데이터(라이브러리 => long) 
 * 			   실수형
 * 			   문자형
 * 			   논리형
 * 			   ---------
 * 			   참조형(사용자정의) => 배열 / 클래스 
 */
public class 변수정리 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
 
	}

}
