/*
 * 		자바 => 클래스 기반
 * 			  -----
 * 				1. 구성요소
 * 					= 변수 : 기본형 데이터 (int,long,double...)
 * 						    참조형 데이터 (배열, 클래스)
 * 											----
 * 					= 메소드 : 
 * 					= 생성자 :
 * 					----------------------------- + (객체지향)
 * 				2. 메소드 : 특정 작업을 수행하는 일련의 명령문의 집합
 * 						  ------- 한가지 기능 수행이 가능하게 만든다
 * 								 -------- 
 * 									ㅣ수정,추가 (다형성) => 오버로딩, 오버라이딩
 * 					ㅣ 주로 사용처 (클래스와 클래스를 연결)
 * 					ㅣ 사용하는 이유
 * 						= 재사용
 * 						= 유지보수(추가,수정) => 가독성
 * 						  문장 => 단락 => 구조적인 프로그램
 * 						= 중복코드 제거
 * 					ㅣ 메소드 구조
 * 					   구성요소 : 리턴형, 메소드명, 매개변수 (인자)
 * 					   [접근지정어][옵션] 리턴형 메소드(매개변수)
 * 					   				 -----	   ------
 * 									 한개만 사용	0개이상 (사용안해도되고 여러개 사용해도되고)
 * 					   = 선언부 / 구현부
 * 						 리턴형 메소드(매개변수) // 선언부
 * 						 {
 * 							// 구현부 => 구현을 해야 메모리에 저장
 * 						 }
 * 						(참고: 선언만 하는 (abstract)라는 지정어가 따로있음)
 * 					------------ 수업 => 메소드에 정답은 없다. 리턴형은 프로그램에 따라 언제든 수정한다
 * 										웹/윈도우는 정수라는 개념없음, String을 거의 사용 => String값 입력/출력
 * 					
 * 	   				= 리턴형 => 한개의 데이터만 설정
 * 							  --------- 기본형, 배열, 클래스	
 * 												  String => 사용자 정의 클래스
 * 						=
 * 						=
 * 					= 매개변수
 * 					= 메소드명
 * 					 
 */
public class 메소드_1 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
