/*
 * 		제어문 : 프로그램을 제어 => 반복수행, 선택출력
 * 				사용자 요청 처리...
 * 		for			: 반복횟수가 존재 => 화면 UI
 * 						=> 웹 프로그램 (Front)
 * 						형식)
 * 								  1   2     4 → 2
 * 							for(초기값;조건식;증감식)
 * 							{       3
 * 								반복수행문장
 * 							}
 * 							1-2-3-4-2-3-4-2-3-4... => 2 false면 종료
 * 
 * 		while		: 반복횟수가 없는 경우 => 서버프로그램(Back)
 * 						=> 크롤링, 데이터베이스, 파일 읽기
 * 						   ------------------------ 
 * 						=> 선조건 (수행을 못할 수도 있다)
 * 		do~while	:	무조건 한번 이상 수행
 * 						=> 웹 (사용빈도 거의 없음)
 * 						=> 후조건 (한번은 반드시 수행)
 * 		------------- 반복문
 */
public class 제어문_반복문_1 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
	}

}
