/*
 * 		면접
 * 		---
 * 		함수 vs 메소드
 * 		----------- 한가지 기능을 수행
 * 		함수 : 독립적으로 사용 (C언어의 단위는 함수)
 * 		메소드 : 클래스 종속   (자바의 단위는 클래스)
 * 		----------------종료하는 시점 ==> return; (메소드)
 * 		배열 / 메소드
 * 		---------- 클래스
 * 				   ---- 객체지향에 맞게
 * 						데이터 보호 (캡슐화)
 * 						재사용 (상속,포함)
 * 							  is-a, has-a
 * 						수정, 추가 
 * 						*** 오버라이딩, 오버로딩
 * 							-------	 ------
 * 							modify	  new
 * 
 * 						===> 유지보수가 쉽게 제작
 */
public class 제어문_반복제어문_4 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		// return이 없는 것처럼 보이지만, 컴파일시 자동적으로 추가되기때문에 생략가능
		// => void만 자동적으로 추가, 이외는 return 써줘야함
	}

}
